tutorials/tutorials/compressible/rhoPimpleFoam/RAS/angledDuct/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 1e-3;

boundaryField
{
    front
    {
        type            compressible::alphatWallFunction;
        value           $internalField;
    }
    back
    {
        type            compressible::alphatWallFunction;
        value           $internalField;
    }
    walls
    {
        type            compressible::alphatWallFunction;
        value           $internalField;
    }
    porosityWall
    {
        type            compressible::alphatWallFunction;
        value           $internalField;
    }
    inlet
    {
        type            calculated;
        value           $internalField;
    }
    outlet
    {
        type            calculated;
        value           $internalField;
    }
}


// ************************************************************************* //
